problems_chap01 = [
    {
        "title" : "算法定义的四个要素",
        "tips"  : "* 有限性\n* 可行性\n* 确定性\n* 有输出",
        "ans"   : "",
        "value" : 1,
        "diff"  : 1
    },
    {
        "title" : "算法的评价维度",
        "tips"  : "* 正确性（有限性检验/结果正确性检验）\n* 效率（多、快、好、省）\n* 稳健性\n* 可重用性",
        "ans"   : "",
        "value" : 1,
        "diff"  : 1
    },
    {
        "title" : "使用递降法的两个方面",
        "tips"  : "* 递归边界\n* 递归调用",
        "ans"   : "",
        "value" : 5,
        "diff"  : 1
    },
    {
        "title" : "三种复杂度记号的概念",
        "tips"  : "",
        "ans"   : "在问题规模充分大的情况下：\n* 大O：规定T(n)的增长速度上界\n* 大Θ：规定T(n)的增长速度上下界\n* 大Ω：规定T(n)的增长速度下界",
        "value" : 4,
        "diff"  : 2
    },
    {
        "title" : "复杂度分析的基本方法",
        "tips"  : "* 递归形式：递降法\n* 迭代形式：积分（求和）法",
        "ans"   : "",
        "value" : 4,
        "diff"  : 1
    }
]